jonLicari/STM32F0-bootloader/STM32/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

void VectorTableRelocate(void);
void PeripheralDeInit(void);
void BLJumpToUserApp(void);
void EraseFlashApp(void);
void WriteToFlash (uint16_t index);
uint32_t ModbusCRC(uint8_t *array, uint16_t length);

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_0
#define B1_GPIO_Port GPIOA
#define LD4_Pin GPIO_PIN_8
#define LD4_GPIO_Port GPIOC
#define LD3_Pin GPIO_PIN_9
#define LD3_GPIO_Port GPIOC
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */
#define BYTES_PER_PAGE 1024
#define BYTES_PER_WORD 4
#define CRC_LEN 5
#define CRC16_POLY 0xA001
#define FLASH_BASE_ADDR ((uint32_t) 0x8000000) // Base address of flash memory
#define FLASH_USR_ADDR ((uint32_t) 0x08005000) // Base address of user app flash memory
#define MAX_FLASH_PAGES 64 // Maximum number of pages of flash memory
#define CALLOC_SIZE 256 // Number of bytes per data packet
#define PCK_LEN 4
#define VT_SIZE 48 	// Number of elements in interrupt vector table

// GPIO Definitions
#define USER_BTN_PORT B1_GPIO_Port
#define USER_BTN_PIN B1_Pin
#define BLUE_LED_PIN GPIO_PIN_8
#define BLUE_LED_PORT GPIOC
#define GREEN_LED_PIN GPIO_PIN_9
#define GREEN_LED_PORT GPIOC


/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
